[
	{
		"title": "CAD Designer for School's First Robotics Team",
		"org": "South Broward High School",
		"period": "2017 - 2020",
		"desclist": [
			"Have a working knowledge of Autodesk Inventor and AutoCAD and assist other students in the usage of those applications.",
			"Design and implement components into the robot design.",
			"3d print and laser cut robot components and assist other students in the usage of those technologies.",
			"Communicate and collaborate with the \"hardware\" part of the team to design, test, and plan new iterations in the robot design.",
			"Create renderings and diagrams of the final robot for the team's engineering notebook.",
			"Received 1st and 2nd for multiple competitions in Florida."
		]
	},
	{
		"title": "Lua Developer",
		"org": "Innovative Gamers",
		"period": "Mar 2019 - Feb 2020",
		"desclist": [
			"Utilized gLua (Garry's Mod's adaptation of the open-source language Lua) to develop client-side and server-side scripts for a Garry's Mod server.",
			"Utilized SQL databases to store and manage player data.",
			"Updated existing code for better performance and compatibility between different addons.",
			"Updated existing code and developed new code to add new features to the server.",
			"Updated in-game content to create a better experience for players.",
			"Communicate with the server staff and players to ensure the enjoyment of the players on the server and to develop new features, depending on what is wanted and/or needed."
		]
	},
	{
		"title": "Summer Camp Counselor",
		"org": "Peg Camp",
		"period": "Jul 2019 - Aug 2019",
		"desclist": [
			"Part of a team of counselors, whose goal was to create a safe and fun environment where kids can learn about up-to-date technology in video game design, engineering, coding, and computer graphics.",
			"Taught multiple computer programs to children at the beginning, intermediate, and advanced levels, including: Python and Tinker CAD",
			"Supported campers through the learning process ensuring a fun and successful experience"
		]
	}
  ]